/* eslint-disable */
// @ts-ignore
const desc = "S : 강동 소패왕 : 손책 : 패시브 : 자신 : 100% : 전투에서 일반 공격 후 35%의 확률로 목표에게 추가로 맹공(피해율 96%→192%) 발동 및 단일 아군 대상의 병력 회복(치료율 28%→56%, 무력의 영향). 자신이 주장일 때 전투 시작 후 2번째 턴까지 단일 적군 대상이 처음 받는 피해 15%→30% 증가 : 주장 \n" +
  "\n" +
  "S : 강직한 마음 : 하후돈 : 패시브 : 적군 다수(2명) : 100% : 전투 중 자신의 통솔 19→38 증가, 무기 피해를 입으면 40%의 확률로 적군 다수 대상(2명)에게 무기 피해(피해율 42%→84%)\n" +
  "\n" +
  "S : 금털의 깃발 : 감녕 : 패시브 : 자신 : 100% : 전투 중 자신의 회심 확률 25%→50%(발동 시 무기 피해 100% 증가) 및 회심 피해 10%→20% 증가. 자신이 주장일 때 우군 다수 대상(2명)의 회심 확률 2.5%→5%와 회심 피해 5%→10% 증가 : 주장 \n" +
  "\n" +
  "S : 남만두목 : 맹획 : 패시브 : 적군 다수(3명) : 100% : 전투 중 매 턴 행동 시 14%→28%의 확률로 적군 전체에게 무기 피해 부여(피해율 53%→106%), 효력이 없으면 발동률 10% 증가 및 자신이 7회 일반 공격을 받은 후 1탄 동안 허약 상태(피해 줄기 불가) 획득 및 발동률 리셋. 자신이 주장이면 발동률 초기화 확률이 17.5%→35%까지 증가 : 주장 \n" +
  "\n" +
  "S : 대담무쌍 : 조운 : 패시브 : 자신 : 100% : 전투 중 자신이 통찰 상태(모든 제어 효과 면역) 획득, 무력, 지력, 속도, 통솔, 20→40 증가. 자신이 주장일 때 25→50 증가 : 주장 \n" +
  "\n" +
  "S : 뛰어난 사슬 : 태사자 : 패시브 : 자신 : 100% : 전투 중 자신이 연격 상태를 획득하여 턴마다 2회 일반 공격을 가하고 목표의 통솔 5→25 감소, 중첩 가능, 2탄 지속\n" +
  "\n" +
  "S : 문무 겸비 : 종회,등애 : 패시브 : 자신 : 100% : 전투 중 자신이 책략 피해를 줄 때마다 지력 15→30 증가, 최대 5회 중첩 가능. 무기 피해를 줄 때마다 무력 15→30 증가, 최대 5회 중첩 가능\n" +
  "\n" +
  "S : 병무상세 : 축융부인, 전풍 : 패시브 : 단일 적군 : 100% : 전투 중 일반 공격 누적 3회 시 공격 목표에게 책략 피해(피해율 120%→240%, 지력의 영향) 및 자신을 치료(치료율 90%→ 180%, 지력의 영향)\n" +
  "\n" +
  "S : 사별삼일 : 여몽 : 패시브 : 자신 : 100% : 전투 시작 후 3번째 턴까지 일반 공격 불가, 15→30%의 확률로 모면효과 획득, 4번째 턴에 자신의 지력 34→68 상승 및 적군 전체에게 책략 피해 부여(피해율 90→180%, 지력의 영향) \n" +
  "\n" +
  "S : 신화계 : 주유 : 패시브 : 적군 다수(3명) : 100% : 전투 중 액티브 전법을 발동할 때마다 40%→80%의 확률로 적군 전체에게 책략 공격(피해율 34%→68%, 지력의 영향). 자신이 주장일 때 해당 공격이 20%→40%의 확률로 목표에게 연소 상태 부여(피해율 34%, 지력의 영향), 1턴 지속 : 주장 \n" +
  "\n" +
  "S : 연인의 포효 : 장비 : 패시브 : 적군 다수(3명) : 100% : 전투 시작 후 2,4번째 턴에 적군 전체에게 무기 공격(피해율 52%→104%), 목표가 무장 해제 상태이면 추가로 목표의 통솔 25%→50% 감소, 2턴 지속. 자신이 주장일 때 통솔 감소 효과가 허망 상태의 목표에게도 추가 : 주장\n" +
  "\n" +
  "S : 유혹 : 대교,견희 : 패시브 : 단일 적군 : 100% : 자신이 일반 공격을 받을 때 20%→40%의 확률로 공격자에게 혼란(전법과 관계없이 목표 선택해 공격), 허망(액티브 전법 발동 불가), 무장 해제(일반 공격 불가),허약(피해 주기 불가)상태 중 1개 부여, 1턴 지속\n" +
  "\n" +
  "S : 장구직입 : 서황 : 패시브 : 자신 : 100% : 전투 중 무기 피해를 줄 때마다 자신이 주는 무기 피해7.5%→15% 증가, 최대5회 중첩 가능\n" +
  "\n" +
  "S : 절대반격 : 하후돈,여령기 : 패시브 : 자신 : 100% : (기병,방패병,창병 전용)전투 중 자신이 무기 피해를 받을 때마다 무력 3→6 증가, 최대 10회 중첩 가능. 5번 째 턴의 중첩 횟수에 따라 적군 전체에게 무기 피해 부여(피해율 60%→120%, 매번 피해율 7%→14% 증가)\n" +
  "\n" +
  "S : 주지육림 : 동탁 : 패시브 : 자신 : 100% : 전투 중 턴마다 자신의 병력 감소(1%X턴 수), 또한 턴마다 배반(무기 피해를 줄 때 자신의 피해량을 기준으로 일정한 병력 회복) 4%→8% 및 무력 15 회복. 자신이 주장이면 5번째 턴부터 아군 부장이 살아있으면 턴마다 적군과 아군 전체에게 무기 피해(피해율30%→60%) : 주장 \n" +
  "\n" +
  "S : 통렬한 자중 : 정보 : 패시브 : 자신 : 100% : 피해를 받을 때 20%→35% 확률로 자신의 디버프를 정화하며, 랜덤 단일 적군 대상이 공포 상태에 들어가게 하고(이동 불가), 1턴이 지속됩니다. 이 효과는 매 턴에 최대 한 번을 촉발할 수 있습니다. : 공포 \n" +
  "\n" +
  "S : 호치 : 허저 : 패시브 : 자신 : 100% : 전투 중 턴마다 단일 적군 대상을 선택하여 피해 고정 및 대상에게 주는 피해 16.5%→33% 증가, 목표를 격파하면 전투가 끝날 때까지 자신이 적진 격파 상태 획득(피해를 줄 때 목표의 통솔과 지력 무시)\n" +
  "\n" +
  "S : 흩뿌려진 피 : 마초 : 패시브 : 자신 : 100% : 전투 중 자신의 무력 17→34 및 범위 공격(일반 공격 시 목표와 같은 부대의 다른 장수에게 피해 부여)효과 27%→54% 획득. 자신이 주장이면 범위 공격치 30%→60% : 주장 \n" +
  "\n" +
  "S : 병력 소집 : 서황,원소 : 패시브 : 자신 : 100% : 전투 중 자신이 휴식 상태를 획득하여 턴마다 일정 병력 회복(회복률 62%→124%)\n" +
  "\n" +
  "S : 봉시진 : 황월영,악진 : 진법 : 아군 다수(3명) : 100% : 전투 중 아군 주장이 주는 피해와 책략 피해 15%→30% 증가, 받는 무기 피해와 책략 피해 20% 증가. 아군 부장이 주는 무기 피해와 책략 피해 15% 감소, 받는 무기 피해와 책략 피해 12.5%→25% 감소\n" +
  "\n" +
  "S : 팔문금쇄진 : 조인 : 진법 : 적군 다수(2명) : 100% : 전투 시작 후 3번째 턴까지 적군 다수 대상(2명)이 주는 피해 15%→30% 감소(지력의 영향) 및 아군 주장이 선공 효과(우선 행동) 획득\n" +
  "\n" +
  "S : 고지악래 : 전위 : 지휘 : 아군 주장 : 100% : 아군 주장이 일반 공격을 받을 때 자신이 공격자에게 맹격 1회 시전(피해율 40%→80%), 주는 무기 피해 9%→18% 감소, 1턴 지속, 그 후 아군 주장의 일반 공격 분담\n" +
  "\n" +
  "S : 공신 : 황월영 : 지휘 : 아군 다수(3명) : 100% : 전투 시작 후 3번째 턴까지 아군 전체가 선공 상태(우선 행동)획득, 아군 주장이 주는 피해 15%→30% 증가, 아군 부장이 주는 피해 7.5%→15% 증가. 4번째 턴부터 아군 전체가 주는 피해 15% 감소, 2턴 지속\n" +
  "\n" +
  "S : 금단의 비술 : 좌자 : 지휘 : 아군 다수(3명) : 100% : 전투 시작 후 2번째 턴까지 아군 전체가 모면 효과를17.5%→35% 획득하여 피해 면역, 3번째 턴부터 휴식 상태 획득(턴마다 병력 1회 회복, 회복률 29%→58%, 지력의 영향), 3턴 지속\n" +
  "\n" +
  "S : 기세등등 : 안량,조비 : 지휘 : 적군 다수(2명) : 100% : 전투 시작 후 2번째 턴까지 적군 다수 대상(2명)에게 턴마다 45%→90%의 확률로 무장 해제 상태 부여, 대상 일반 공격 불가\n" +
  "\n" +
  "S : 꺽인 기세 : 손견, 진군 : 지휘 : 단일 적군 : 100% : 전투 시작 후 3번째 턴까지 단일 적군 대상에게 허약 상태 부여, 피해를 줄 때 32.5%→65%의 확률로 피해 부여 불가\n" +
  "\n" +
  "S : 꿈 속의 처단 : 조조 : 지휘 : 자신 : 100% : 전투 시작 후 2번째 턴까지 자신이 주장이면 랜덤의 부장이 자신의 피해 20%→40% 분담, 3번째 턴부터 자신이 행동 시 디버프가 있으면 25%→50% 확률로 전투 종료 때까지 반격 상태 획득(피해율 150%) : 주장 \n" +
  "\n" +
  "S : 난세의 간웅 : 조조 : 지휘 : 아군 다수(3명) : 100% : 전투 중 우군 다수 대상(2명)이 주는 피해 8%→16% 증가(지력의 영향), 자신이 받는 피해 9%→18% 감소(지력의 영향). 자신이 주장이면 부장이 피해를 줄 때 해당 피해량의 10% 만큼 병력 회복 : 주장 \n" +
  "\n" +
  "S : 대설전 : 제갈량 : 지휘 : 적군 다수(3명) : 100% : 적군이 액티브 전법 발동 시 15%→25%의 확률로 해당 적군의 발동률 5%감소(지력의 영향 )및 자신과 랜덤 우군의 액티브 전법 발동률 2%→4% 증가(지력의 영향), 1턴 지속\n" +
  "\n" +
  "S : 백의 도강 : 여몽 : 지휘 : 자신 : 100% : 전투 시작 후 첫 번째 턴에 아군 전체가 방어 1회 획득.자신이 무기 공격 시 20%→40%의 확률로 단일 적군 대상에게 무장 해제(일반 공격 불가)부여, 2턴 지속.책략 피해를 줄 때 20%→40%의 확률로 단일 적군 대상에게 허망(액티브 전법 발동 불가) 부여, 1턴 지속, 해당 효과는 턴마다 각각 최대1회 발동 가능\n" +
  "\n" +
  "S : 세상에 가득찬 덕 : 유비 : 지휘 : 아군 다수(2명) : 100% : 턴마다 아군 다수를 치료(2명, 치료율 34%→68%, 지력의 영향)하고 5%→10%의 확률로 적군 단일 대상에게 허약 상태(피해 주기 불가)부여, 1턴 지속. 자신이 주장이면 허약 상태의 부여 확률이 12.5%→25%까지 증가 : 주장 \n" +
  "\n" +
  "S : 수이필고 : 정욱,조식 : 지휘 : 적군 주장 : 100% : 전투 시작 시 적군 주장을 도발하고(목표가 자신을 일반 공격) 자신의 통솔 20→40 증가, 4턴 지속\n" +
  "\n" +
  "S : 신기묘산 : 제갈량 : 지휘 : 적군 다수(2명) : 100% : 적군 다수 대상(2명)이 액티브 전법 발동 시 25%→35%의 확률로 패배 및 대상에게 책략 피해 부여(피해율100%, 지력의 영향). 자신이 주장이면 해당 피해가 양측의 지력의 차에 따라 추가로 증가 : 주장 \n" +
  "\n" +
  "S : 신묘한 술법 : 우길 : 지휘 : 적군 다수(3명) : 100% : 전투 시작 후 2번째 턴부터 적군 전체에게 수공 상태 부여, 턴마다 지속 피해(피해율36%→72%, 지력의 영향), 5턴 지속\n" +
  "\n" +
  "S : 십승실패 : 곽가 : 지휘 : 우군 주장 : 100% : 전투 시작 후 2번째 턴까지 아군 주장이 통찰상태(모든 제어 효과에 면역)획득, 받는 피해 25%→50% 감소\n" +
  "\n" +
  "S : 의심소열 : 유비 : 지휘 : 아군 다수(3명) : 100% : 전투 중 자신이 치료 효과를 부여할 때 목표가 받는 액티브 전법 피해가 7%→14%(지력의 영향) 감소, 1턴 지속. 자신의 병력이 처음으로 30%→40% 미만일 때 아군 전체가 피해를 받으면 25%→50% 분담, 1턴 지속\n" +
  "\n" +
  "S : 잠피기봉 : 방덕,서서 : 지휘 : 아군 다수(2명) : 100% : 전투 시작 후 3번째 턴까지 아군 중 지력이 가장 높은 장수가 받는 무기 피해 20%→40% 감소(지력의 영향),아군 중 무력이 가장 높은 장수가 받는 책략 피해 20%→40% 감소(지력의 영향)\n" +
  "\n" +
  "S : 좌단동남 : 손권 : 지휘 : 자신 : 100% : 전투 중 자신과 우군의 단일 대상이 일반 공격을 발동하면 자신이 37.5%→75%의 확률로 연격, 통찰, 선공, 필중, 적진 격파 상태 중 1개를 랜덤 획득, 2턴 지속.자신이 주장이면 우선적으로 다른 상태 획득 : 주장 \n" +
  "\n" +
  "S : 청낭 : 화타 : 지휘 : 아군 다수(2명) : 100% : 전투 시작 후4번째 턴까지 아군 다수 대상(2명)이 통솔20→40(지력의 영향)과 구급 효과 획득,매회 피해를 받을 때50%확률로 일정한 병력 회복(치료율44%→88%,지력의 영향)\n" +
  "\n" +
  "S : 화신의 기개 : 축융 부인 : 지휘 : 아군 다수(2명) : 100% : 전투 시작 후2번째 턴까지 아군 다수 대상(2명)이 필중 상태 획득, 3번째 턴에 허약 상태(피해 주기 불가)면역 및 자신의 매 턴 행동 전에 아군 다수대상 치료(2명,치료율 79%→158%,무력의 영향), 3턴 지속\n" +
  "\n" +
  "S : 강동맹호 : 손견 : 액티브 : 적군 다수(2명) : 50% : 적군 다수 대상(2명)에게 무기 피해 63%→126% 및 도발(목표가 자신을 일반 공격), 2턴 지속\n" +
  "\n" +
  "S : 경국의 미인 : 초선 : 액티브 : 적군 다수(1~2명) : 25%→40% : 1턴 준비 후 적군 다수 대상(1~2명)에게 혼란 상태 부여(전법과 관계없이 목표 선택해 공격) 및 50%의 확률로 아군 다수 대상(2명)이 받는 피해 8%→16% 감소, 2턴 지속, 자신이 여성이면 반드시 적군의 다수 대상(2명)선택 : 여성 \n" +
  "\n" +
  "S : 고육계 : 황개 : 액티브 : 단일 적군 : 40% : 자신에게 무기 피해를 주고(피해율40%) 단일 적군 대상에게 연소(피해율 61%→122%, 지력의 영향)와 혼란(전법과 관계없이 목표를 선택해 공격)상태 부여 및 자신이 받는 무기 피해 15%→30% 감소, 2턴 지속\n" +
  "\n" +
  "S : 관우의 상처 : 화타 : 액티브 : 단일 아군 : 40% : 병력 손실이 가장 많은 단일 아군 대상의 디버프 해제 및 병력 회복(치료율128%→256%, 지력의 영향)\n" +
  "\n" +
  "S : 굳건한 군대 : 우금 : 액티브 : 적군 다수(2명) : 35% : 자신이 다음에 받는 무기 피해가 40%증가, 1턴 지속.자신의 무력 28→56 증가, 3턴 지속. 또한 적군 다수 대상(2명)에게 맹렬한 일격 발동(피해율 92%→184%)\n" +
  "\n" +
  "S : 굳건한 마음 : 서서 : 액티브 : 적군 다수(2명) : 35% : 적군 다수 대상(2명)이 30%→60%의 확률로 연소(지력의 영향), 중독(지력의 영향), 패배(무력의 영향)상태 랜덤 획득, 턴마다 지속 피해(피해율70%), 상태마다 독립 판정, 2턴 지속\n" +
  "\n" +
  "S : 깔끔한 계책 : 종회 : 액티브 : 적군 다수(2명) : 45% : 1턴 준비 후 적군 2명에게 책략 공격(피해율 105%→210%, 지력의 영향) 및 무장 해제(일반 공격 불가), 2턴 지속\n" +
  "\n" +
  "S : 난공불락 : 조인 : 액티브 : 자신 : 35%→45% : 자신이 통찰 상태(모든 제어 효과 면역)획득 및 적군 전체 도발(목표가 자신에게 일반 공격), 또한 자신의 통솔 75→150 증가, 2턴 지속\n" +
  "\n" +
  "S : 대륙의 위세 : 관우 : 액티브 : 적군 다수(3명) : 35% : 1턴 준비 후 적군 전체에게 맹공(피해율 73%→146%)및 대상에게 랜덤으로 무장 해제(일반 공격 불가) 또는 허망(액티브 전법 발동 불가) 부여, 1턴 지속. 자신이 주장일 때 추가로 자신이 주는 무기 피해 18%→36% 증가, 2턴 지속 : 주장 \n" +
  "\n" +
  "S : 독주 : 이유 : 액티브 : 단일 적군 : 70% : 단일 적군 대상에게 독주를 시전하여 대상의 무력 30%→60% 감소(지력의 영향), 1턴 지속, 1턴 후 독이 퍼져 책략 공격 발동(피해율113%→226%, 지력의 영향)및 대상의 통솔 30→60 감소(지력의 영향), 전투 종료까지 무제한 중첩 가능\n" +
  "\n" +
  "S : 맹렬한 불길 : 육손 : 액티브 : 적군 다수(3명) : 35% : 1턴 준비 후 적군 전체에게 화공(피해율 51%→102%,지력의 영향)및 연소 상태 부여, 턴마다 지속 피해(피해율 36%→72%, 지력의 영향), 2턴 지속\n" +
  "\n" +
  "S : 목숨 건 전투 : 방덕 : 액티브 : 적군 다수(2명) : 30% : 1턴 준비 후 적군 다수 대상(2명)의 버프를 해제하고 무기 공격(피해율 127.5%→255%)\n" +
  "\n" +
  "S : 무한한 충성 : 전풍 : 액티브 : 적군 다수(1~2명) : 35%→50% : 1턴 준비 후 적군 다수 대상(1~2명)의 속도 15% 감소(지력의 영향) 및 혼란 상태(전법과 관계없이 목표 선택해 공격)부여, 2턴 지속. 또한 우군 단일 대상이 방어 1회 획득, 1턴 지속\n" +
  "\n" +
  "S : 백발 백중 : 황충 : 액티브 : 적군 다수(3명) : 35% : 1턴 준비 후 자신의 회심 확률 12.5%→25% 증가(발동 시 무기 피해 100%증가), 2턴 지속. 이후 적군 전체에게 무기 공격(피해율 90%→180%), 목표가 제어 상태일 경우 이번 무기 공격 더욱 강화(피해율 120%→240%)\n" +
  "\n" +
  "S : 병봉 : 장소,맹획 : 액티브 : 아군 다수(2명) : 25%→35% : 자신과 우군 단일 대상이 연격(턴마다 일반 공격2회 가능)상태 획득, 1턴 지속\n" +
  "\n" +
  "S : 분노한 창 : 장비 : 액티브 : 자신 : 40% : (기병,방패병,창병,병기 전용)자신이 무력 25→50 증가 및 범위 공격(일반 공격 시 목표와 같은 부대의 다른 장수에게 피해 부여) 획득(피해율 35%→70%), 2턴 지속\n" +
  "\n" +
  "S : 불난 데 부채질 : 주유,황개 : 액티브 : 단일 적군 : 45% : 단일 적군 대상에게 책략 피해(피해율 77%→154%, 지력의 영향), 목표가 연소 상태이면 추가로 책략 피해 1회(피해율 99%→198%, 지력의 영향)\n" +
  "\n" +
  "S : 사면초가 : 순욱,이유 : 액티브 : 적군 다수(2명) : 50% : 1턴 준비 후 적군 다수 대상(2명)에게 중독 상태를 시전하여 턴마다 지속 피해(피해율 72%→144%, 지력의 영향), 2턴 지속\n" +
  "\n" +
  "S : 사자분신 : 여령기 : 액티브 : 적군 다수(2~3명) : 35% : 단일 적군 대상 및 추가로 적군 1~2명에게 무기 공격(피해율 59%→118%), 자신의 액티브 전법 발동률 5%→10% 증가(자신이 주장일 때 발동률 7.5%→15%까지 증가), 2턴 지속, 단일 대상의 목표가 적군 주장이면 대산에게 모반 상태 부여, 턴마다 지속 피해(피해율 51%→102%, 무력 또는 지력 중 높은 항목의 영향을 받고 방어 무시), 2턴 지속 : 주장 \n" +
  "\n" +
  "S : 십면매복 : 정욱 : 액티브 : 적군 다수(2명) : 35% : 디버프 상태의 적군에게 책략 공격(피해율 48%→ 96%, 지력의 영향) 후, 적군 다수 대상(2명)에게 치료 금지(병력 회복 불가) 및 모반 상태를 부여하여 턴마다 지속 피해(피해율 37%→74%, 무력 또는 지력 중 높은 항목의 영향을 받고 방어 무시), 2턴 지속\n" +
  "\n" +
  "S : 양동작전 : 등애 : 액티브 : 단일 적군 : 25%→50% : 1턴 준비 후 단일 적군 대상에게 책략 공격(피해율260%, 지력의 영향) 및 공포 상태(행동 불가) 부여, 2턴 지속\n" +
  "\n" +
  "S : 와신상담 : 손권 : 액티브 : 적군 다수(2명) : 45% : 적군 다수 대상(2명)에게 무기 공격 1회(피해율 48%→96%) 및 25%의 확률로(자신의 연격, 통찰, 선공, 필증, 적진 격파 상태가 1개 증가할 때마다 확률 5%→10% 증가)공포 상태(행동 불가) 부여, 1턴 지속\n" +
  "\n" +
  "S : 용감무쌍 : 문추 : 액티브 : 단일 적군 : 55% : 단일 대상 목표에게 무기 공격(피해율 104%→208%) 및 무장 해제(일반 공격 불가), 자신의 통솔 40%감소 및 치료 금지 상태(병력 회복 불가) 부여, 2턴 지속\n" +
  "\n" +
  "S : 유인책 : 사마휘,화웅 : 액티브 : 적군 다수(2명) : 40% : 1턴 준비 후 적군 다수 대상(2명)에게 모래폭풍 상태 부여, 턴마다 지속 피해(피해율 63%→126%, 지력의 영향) 및 대상이 받는 무기 피해 25%증가, 2턴 지속\n" +
  "\n" +
  "S : 의심암귀 : 좌자,우길 : 액티브 : 적군 다수(2명) : 50% : 1턴 준비 후 적군 다수 대상(2명)에게 책략 공격 1회(피해율 76.5%→153%) 및 아군 다수 대상(2명)의 일정한 병력 회복(회복률 51%→102%, 지력의 영향)\n" +
  "\n" +
  "S : 이어지는 명성 : 원소 : 액티브 : 적군 다수(2명) : 50% : 1턴 준비 후 적군 다수 대상(2명)에게 무기 공격 1회(피해율 63%→126%), 대상의 통솔 12→24 감소(무력의 영향) 및 연소 상태를 부여하여 턴마다 지속 피해(피해율30%→60%, 지력의 영향), 2턴 지속. 자신이 주장이면 추가로 아군 전체의 통솔 40→80% 증가, 3턴 지속 : 주장 \n" +
  "\n" +
  "S : 이일대로 : 법정 : 액티브 : 아군 다수(2명) : 35% : 아군 다수 대상 치료(2명, 치료율77%→154%, 지력의 영향) 및 다음 3회 피해에서 받는 피해 감소(각각25%→50%, 18.8%→37.5%, 12.5%→25%), 지력의 영향) 다음 제어 상태에 25%→40%의 확률(지력의 영향)로 면역\n" +
  "\n" +
  "S : 일망타진 : 관우,조운 : 액티브 : 적군 다수(3명) : 40% : 적군 전체에게 무기 피해 50%→100% 부여, 목표가 무장 해제 또는 허망 상태이면 20%→30%의 확률로 목표에게 공포 상태(행동 불가)부여, 1턴 지속\n" +
  "\n" +
  "S : 일망타진 : 관우,조운 : 액티브 : 적군 다수(3명) : 40% : 적군 전체에게 무기 피해 50%→100% 부여, 목표가 무장 해제 또는 허망 상태이면 20%→30%의 확률로 목표에게 공포 상태(행동 불가)부여, 1턴 지속\n" +
  "\n" +
  "S : 일제 사격 : 황충,하후연 : 액티브 : 적군 다수(3명) : 40% : (궁병 전용) 1턴 준비 후 적군 전체에게 무기 공격 발동(피해율 70%→140%) 및 50%의 확률로 패배 상태를 부여하여 턴마다 지속 피해(피해율 60%→120%, 무력의 영향), 1턴 지속\n" +
  "\n" +
  "S : 임전선동 : 악진 : 액티브 : 적군 다수(2명) : 100% : 적군 다수 대상(2명)에게 무기 공격(피해율 67.5%→135%) 후 자신에게 허약 상태(피해 주기 불가) 부여, 1턴 지속\n" +
  "\n" +
  "S : 적진 함락 : 손책,문추 : 액티브 : 적군 다수(2명) : 35% : 1턴 준비 후 적군 다수 대상(2명)의 통솔, 지력 40→80 감소(무력의 영향), 2턴 지속 및 대상에게 무기 공격 1회(피해율79%→158%)\n" +
  "\n" +
  "S : 천하무쌍 : 여포 : 액티브 : 단일 적군 : 25%→35% : 단일 적군 대상에게 결투를 요청하여 양측이 순서대로 상대방에게 일반공격 3회 가함, 자신이 우선 공격 진행. 결투 중 양측은 무장 해제와 공포 상태에 영향을 받지 않고 범위 공격과 돌격 전법 발동 가능. 자신이 주장이면 결투 후 자신이 받는 무기 피해 3.5%→7% 감소(무력의 영향), 2턴 지속 : 주장 \n" +
  "\n" +
  "S : 천하무적 : 마초,허저 : 액티브 : 적군 다수(3명) : 30% : (기병,방패병,창병,병기 전용) 1턴 준비 후 적군 전체에게 무기 공격 1회(피해율 102.4%→204.8%)\n" +
  "\n" +
  "S : 청천벽력 : 장각 : 액티브 : 적군 다수(3명) : 45% : 1턴 준비 후 적군 랜덤 단일 대상에게 책략 공격(피해율 51%→102%, 지력의 영향), 총5회 발동하며 매번 별도로 목표 선택. 목표가 수공상태이면 30%확률로 공토 상태 부여(행동 불가), 1턴 지속. 자신이 주장이면 공포의 확률 50%증가 및 모래폭풍 상태에 유효 : 주장 \n" +
  "\n" +
  "S : 침사결수 : 곽가,법정 : 액티브 : 적군 다수(2명) : 40% : 1턴 준비 후 적군 다수 대상(2명)에게 수공 상태 부여,턴마다 지속 피해(피해율 63%→126%,지력의 영향을 받음) 및 대상이 받는 책략 피해 25%증가, 2턴 지속\n" +
  "\n" +
  "S : 폐월 : 초선 : 액티브 : 단일 적군 : 40%→75% : 적군 1명을 선택하여 자신의 피해 12.5%→25% 분담(지력의 영향). 목표가 적군 중 무력이 가장 높으면 혼란 상태 부여(전법과 관계없이 목표 선택해 공격), 목표가 적군 중 지력이 가장 높으면 허망 상태 부여(액티브 전법 발동 불가) 또는 허약(피해 주기 불가)과 치료 금지(병력 회복 불가)상태 부여, 1턴 지속\n" +
  "\n" +
  "S : 호가의 소리 : 채문희 : 액티브 : 아군 다수(2명) : 50% : 아군 다수 대상 치료(2명, 치료율 61%→122%, 지력의 영향) 및 자신과 우군의 단일 대상이 받는 피해 13%→26% 감소(지력의 영향), 2턴 지속\n" +
  "\n" +
  "S : 호전적 군웅 : 화웅 : 액티브 : 적군 다수(2명) : 35% : 1턴 준비 후 적군 다수 대상(2명)에게 무기 공격 1회(피해율 100%→200%), 이후 자신이 주는 무기 피해12.5%→25% 증가, 받는 무기 피해 감소(12.5%→25%, 무력의 영향), 2턴 지속\n" +
  "\n" +
  "S : 혼비백산 : 소교, 채문희 : 액티브 : 단일 적군 : 55% : 단일 적군 대상의 무력, 지력, 속도, 통솔 19→38 훔치기(지력의 영향을 받음), 2턴 지속, 2회 중첩 가능\n" +
  "\n" +
  "S : 화소연영 : 육손 : 액티브 : 단일 적군 : 50% : 단일 적군 대상에게 연소 상태(피해율 41%→82%, 지력의 영향) 부여, 3턴 지속, 랜덤으로 2회 부여. 만약 이미 연소 상태의 목표일 경우 적군 전체에 책략 공격(31%→62%, 지력의 영향, 자신을 주장으로 할 때, 피해율이 49%→98%까지 증가), 또한 30% 확률로 연소 상태의 적군에 위협 상태 부여, 1턴 지속, 이후 또다른 적군에게 연소 상태 부여 : 주장 \n" +
  "\n" +
  "S : 황천태평 : 장각 : 액티브 : 적군 다수(2명) : 25%→35% : 1턴 준비 후 자신에게 혼란 상태(전법과 관계없이 목표 선택해 공격)를 부여하는 대신 적군 다수 대상(2명)에게 허망 상태(액티브 전법 발동 불가)부여, 2턴 지속\n" +
  "\n" +
  "S : 대극사 : 장합 : 병종 : 아군 다수(3명) : 100% : (창병 전용)아군 전체 일반 공격 시 35%의 확률로 기타 단일 적군 대상에게 무기 피해 부여(피해율61%→122%). 장합이 지휘관이면 발동률 40%까지 증가\n" +
  "\n" +
  "S : 등갑병 : 올돌골 : 병종 : 아군 다수(3명) : 100% : (방패병 전용)아군 전체의 받는 무기 피해가 12%→24% 감소하지만(통솔의 영향), 연소 상태 시 턴마다 병력 손실 추가(피해율 300%). 올돌골이 지휘관이면 연소 상태의 병력 손실 감소(피해율 250%)\n" +
  "\n" +
  "S : 무당비군 : 왕평 : 병종 : 아군 다수(3명) : 100% : (궁병 전용)아군 전체의 통솔, 속도 11→22증가, 첫 번째 턴에 적군의 다수 대상(2명)에게 중독 상태 부여로 턴마다 지속 피해(피해율 40%→80%, 지력의 영향), 3턴 지속. 왕평이 지휘관이라면 적군 전체에게 중독 상태를 부여하지만 피해율 감소(피해율 33%→66%, 지력의 영향)\n" +
  "\n" +
  "S : 백마의종 : 공손찬 : 병종 : 아군 다수(3명) : 100% : (궁병 전용)부대의 행군 속도 25%→50% 증가. 아군 전체가 2번째 턴까지 선공(우선 행동)획득 및 액티브 전법 발동률 5%→10% 증가. 공손찬이 지휘관이면 속도에 따라 발동률 증가\n" +
  "\n" +
  "S : 백이병 : 진도 : 병종 : 아군 다수(3명) : 100% : (창병 전용)아군 전체가 일반 공격 후 20%→40%의 확률로 목표에게 추가 책략 공격 1회(피해율 55%→110%, 지력의 영향을 받음). 진도가 지휘관이면 책략 공격 강화(피해율 65%→130%, 지력의 영향을 받음)\n" +
  "\n" +
  "S : 서량의 철기 : 마등 : 병종 : 아군 다수(3명) : 100% : (기병 전용)전투 시작 후 3번째 턴까지 아군 전체의 회심 확률 12.5%→25% 증가(발동 시 무기 피해100% 증가).마등이 지휘관이면 속도에 따라 회심 확률 증가\n" +
  "\n" +
  "S : 함진영 : 고순 : 병종 : 아군 다수(3명) : 100% : (방패병 전용)아군 전체의 무력, 통솔 11→22 증가,전투 시작 후 3번째 턴까지 구급 상태 획득, 피해를 받을 시 30%의 확률로 치료 획득(치료율 30%→60%, 지력의 영향). 고순이 지휘관이면 통솔에 따라 치료율 추가 증가\n" +
  "\n" +
  "S : 호표기 : 조순 : 병종 : 아군 다수(3명) : 100% : (기병 전용)아군 전체의 무력 20증가, 전투 시작 후 3번째 턴까지 아군 전체의 돌격 전법 발동률 5% 증가. 조순이 지휘관이면 추가로 무력에 따라 발동률 증가\n" +
  "\n" +
  "S : 극악무도 : 동탁 : 돌격 : 단일 적군 : 25%→35% : 일반 공격 후 공격 목표에게 추가로 무기 공격 1회(피해율 196%) 및 혼란 상태(전법과 관계없이 목표 선택해 공격) 부여, 1턴 지속\n" +
  "\n" +
  "S : 극적제승 : 정보,우금 : 돌격 : 단일 적군 : 40% : 일반 공격 후 공격 목표에게 추가로 책략 피해 1회(피해율 90%→180%, 지력의 영향), 목표가 패배나 중독 상태이면 70%의 확률로 목표에게 허약 상태(피해 주기 불가)부여, 1턴 지속\n" +
  "\n" +
  "S : 삼군의 으뜸 : 안량 : 돌격 : 단일 적군 : 30% : 일반 공격 후 공격 목표에게 추가로 맹공(피해율 90%→180%)및 공포 상태(행동 불가) 부여, 1턴 지속\n" +
  "\n" +
  "S : 일기당천 : 여포 : 돌격 : 적군 다수(3명) : 30% : 일반 공격 후 적군 전체에게 무기 공격1회(피해율 36%→72%). 자신이 주장이면 해당 무기 공격이 더욱 강력하게 변화(피해 율54%→108%) : 주장 \n" +
  "\n" +
  "S : 장수의 속도 : 하후연 : 돌격 : 단일 적군 : 30%→60% : 일반 공격 후 랜덤의 단일 적군 대상에게 무기 공격 1회(피해율 158%), 적군 주장을 명중시키면 허망 상태 부여 가능(액티브 전법 발동 불가), 2턴 지속\n" +
  "\n" +
  "S : 적군 제압 : 태사자,전위 : 돌격 : 단일 적군 : 25%→45% : 일반공격 후 랜덤 단일 적군 대상의 통솔과 지력 100감소, 2턴 지속. 자신이 주장이 아니면 추가로 아군 주장이 방어 2회 획득, 피해 면역 가능, 2턴 지속\n" +
  "\n" +
  "S : 적진 습격 : 감녕 : 돌격 : 단일 적군 : 40% : (기병 전용)일반 공격 후 랜덤의 단일 적군 대상에게 무기 공격 1회(피해율 81%→162%) 및 50%의 확률로 적군 주장에게 무기 공격 1회(피해율 60%→120%)\n" +
  "\n" +
  "S : 공훈 거사 : 장소 : 내정 : 자신 : 100% : 장수를 주정관으로 임명하면 전체 자원의 생산량 1.3%→2.5% 증가\n" +
  "\n" +
  "S : 고고한 명성 : 진군 : 내정 : 자신 : 100% : 장수를 제철관으로 임명하면 철광 생산량 1.5%→3% 증가\n" +
  "\n" +
  "S : 나라의 발전 : 조비 : 내정 : 자신 : 100% : 주정관을 임명하면 건물 레벨업 시간 15%→30% 감소\n" +
  "\n" +
  "S : 수경 선생 : 사마휘 : 내정 : 자신 : 100% : 장수를 탐방사로 임명하면 고급 보상을 찾을 확률 4.5%증가\n" +
  "\n" +
  "S : 왕좌지재 : 순욱 : 내정 : 자신 : 100% : 장수의 정치 36→72 증가\n" +
  "\n" +
  "S : 절세 미인 : 대교 : 내정 : 자신 : 100% : 장수를 무역관으로 임명하면 무역비율 1.5%→3% 증가\n" +
  "\n" +
  "S : 칠보성시 : 조식 : 내정 : 자신 : 100% : 장수를 단조관으로 임명하면 고급 장비 단조 확률 4.5%→9% 증가\n" +
  "\n" +
  "S : 타고난 미모 : 소교 : 내정 : 자신 : 100% : 장수의 매력 13.5%→27% 증가\n" +
  "\n" +
  "S : 화용월태 : 견희 : 내정 : 자신 : 100% : 장수를 훈련사로 임명하면 훈련경험치 획득 3%→6% 증가\n" +
  "\n" +
  "A : 굳센 의지 : 주창 : 패시브 : 자신 : 100% : 2번째 턴까지 범위 공격(피해율 50%→100%) 상태를 획득하지만, 50%의 확률로 범위 공격 발동 가능(일반 공격 시 목표와 같은 부대의 다른 장수에게 피해 부여), 3번째 턴부터 턴마다 무력 7.5→15 증가\n" +
  "\n" +
  "A : 백동성강 : 여범,서성 : 패시브 : 자신 : 100% : 자신의 무력, 지력, 통솔, 속도 18→36 증가\n" +
  "\n" +
  "A : 백미 : 마량 : 패시브 : 자신 : 100% : 전투 중 자신의 액티브 전법의 발동률 6%→12% 증가\n" +
  "\n" +
  "A : 분투 : 관평 : 패시브 : 자신 : 100% : 일반 공격 후 자신이 주는 무기 피해가 6%→12% 증가하며 최대 3회 중첩 가능. 또한 35%의 확률로 목표에게 무장 해제 부여(일반 공격 불가), 1턴 지속\n" +
  "\n" +
  "A : 자가 치유 : 동습 : 패시브 : 자신 : 100% : 전투 중 자신이 휴식 상태를 획득하여 턴마다 일정 병력 회복(회복률 50%→100%)\n" +
  "\n" +
  "A : 침착한 대응 : 황보숭 : 패시브 : 단일 적군 : 100% : 일반 공격을 받을 때 공격자에게 1회 반격(피해율 26%→52%)\n" +
  "\n" +
  "A : 거짓 항복 : 요화 : 지휘 : 자신 : 100% : 전투 시작 후 첫 번째 턴에 자신이 혼란 상태(전법과 관계없이 목표 선택해 공격)획득, 2번째 턴부터 휴식 상태(턴마다 병력 1회 회복, 치료율 80%→160%, 지력의 영향)회득, 3턴 지속\n" +
  "\n" +
  "A : 대항의 자벽 : 곽회 : 지휘 : 아군 다수(2명) : 100% : 전투 시작 후 4번째 턴까지 아군 다수 대상(2명)이 받는 피해 12.5%→25% 감소\n" +
  "\n" +
  "A : 장자의 바람 : 이만성 : 지휘 : 아군 다수(3명) : 100% : 아군 전체의 무력,지력 14→28 증가\n" +
  "\n" +
  "A : 진퇴양난 : 유봉 : 지휘 : 적군 다수(2명) : 100% : 자신 외 우군이 일반 공격을 받을 때 20%→35%의 확률로 해당 턴에 치료 금지(병력 회불 불가)가 되고, 적군 다수 대상(2명)에게 무기 공격(피해율 36%→72%)\n" +
  "\n" +
  "A : 황건적 평정 : 주준 : 지휘 : 양측 전체 : 100% : 전투 시작 후 2번째 턴에 아군 전체에게 모래폭풍 면역 상태 부여, 적군 전체는 모반 상태가 되어 턴마다 지속 피해(피해율 44%→88%, 무력 또는 지력 중 높은 항목의 영향을 받고 방어 무시), 2턴 지속, 목표가 황건군이면 피해율 20% 증가\n" +
  "\n" +
  "A : 가혹한 세금 : 곽사 : 액티브 : 단일 적군 : 45% : 단일 적군 대상에게 무기 공격2회(피해율 51%→102%), 목표가 공포상태이면 치료 금지 효과 부여, 2턴 지속, 2차 공격 목표는 독립 판정\n" +
  "\n" +
  "A : 강공 : 간옹,기령 : 액티브 : 액티브 : 25%→45% : 자신에게 연격 상태 부여(턴마다 일반 공격 2회 가능), 1턴 지속\n" +
  "\n" +
  "A : 겁쟁이 : 종요,봉기 : 액티브 : 적군 다수 : 45% : 1턴 준비 후 적군 다수 대상(2명)에게 책략 공격(피해율 52.5%→105%, 지력의 영향)과 모래폭풍 상태 부여, 턴마다 지속 피해(피해율 60%→120%, 지력의 영향), 1턴 지속\n" +
  "\n" +
  "A : 격렬한 설전 : 왕랑 : 액티브 : 적군 다수(3명) : 50% : 적군 전체에게 책략 공격(피해율 30%→60%, 지력의 영향) 및 도발(목표가 자신을 일반 공격) 부여, 1턴 지속\n" +
  "\n" +
  "A : 겸양 : 공융  : 액티브 : 단일 아군 : 40% : 단일 아군 대상이 받는 피해 11%→22% 감소(지력의 영향), 3턴 지속\n" +
  "\n" +
  "A : 고성사수 : 심배  : 액티브 : 아군 다수(2명) : 45% : 아군 다수 대상(2명)의 병력 회복(치료율 58%→116%,지력의 영향)\n" +
  "\n" +
  "A : 낙뢰 : 진림 : 액티브 : 기타 단일 : 50% : 랜덤의 기타 단일 대상(5%의 확률로 우군에게 시전)에게 책략 공격(피해율 85%→170%, 지력의 영향)및 대상이 받는 책략 피해 9%→18% 증가, 2턴 지속\n" +
  "\n" +
  "A : 낙봉 : 장임  : 액티브 : 단일 적군 : 35% : 랜덤의 단일 적군 대상에게 무기 공격(피해율 125%→250%)및 허망(액티브 전법 불가)부여, 1턴 지속\n" +
  "\n" +
  "A : 뛰어난 기량  : 마속 : 액티브 : 아군 다수(2명) : 40% : 아군 다수 대상(2명)이 주는 책략 피해 13.5%→27% 증가, 2턴 지속\n" +
  "\n" +
  "A : 무모 :  관해 : 액티브 : 자신 : 35% : 자신이 통찰(모든 제어 효과 면역) 및 21%→42%의 배반(무기 피해를 줄 때 피해량에 따라 일정 병력 회복)획득, 2턴 지속\n" +
  "\n" +
  "A : 무차별 도륙 : 조진 : 액티브 : 단일 적군 : 35% : 단일 적군 대상에게 무기 공격1회(피해율 75%→150%)및 책략공격(피해율 75%→150%, 지력의 영향)\n" +
  "\n" +
  "A : 백병전  : 정봉 : 액티브 : 단일 적군 : 40% : 단일 적군 대상의 통솔 15→30 감소, 1턴 지속 및 대상에게 무기 공격 1회(피해율 105%→210%)\n" +
  "\n" +
  "A : 복배수적 : 봉기 : 액티브 : 단일 적군 : 45% : 자신 및 적군 중 지력이 가장 높은 장수가 단일 적군 대상에게 책략 공격(피해율 59%→118%, 지력의 영향)\n" +
  "\n" +
  "A : 불벼락 : 장흠 : 액티브 : 적군 다수(2명) : 50% : 1턴 준비 후 적군 다수 대상(2명)에게 무기 공격1회(피해율 59%→118%) 및 연소 효과 부여, 턴마다 지속 피해(피해율 33%→66%, 지력의 영향), 1턴 지속\n" +
  "\n" +
  "A : 불의의 습격 : 보연사 : 액티브 : 적군 다수(2명) : 20%→35% : 1턴 준비 후 적군 다수 대상(2명)에게 랜덤으로 허망(액티브 전법 공격 불가)또는 무장 해제(일반 공격 불가)부여, 1~2턴 지속(30%의 확률로 2턴 지속)\n" +
  "\n" +
  "A : 사명 완수 : 반장 : 액티브 : 단일 적군 : 40% : 단일 적군 대상에게 무기 공격 1회(피해율 110%→220%) 및 15%→30%의 확률로 공포 상태(행동 불가)부여, 1턴 지속 \n" +
  "\n" +
  "A : 성동격서 : 동윤,주준 : 액티브 : 적군 다수(2명) : 40% : 1턴 준비 후 적군 다수 대상(2명)에게 책략 공격(피해율 87.5%→175%, 지력의 영향) 및 속도 15→30 감소, 2턴 지속\n" +
  "\n" +
  "A : 세찬 동향 : 장수 : 액티브 : 단일 적군 : 35% : 1턴 준비 후 적군 주장에게 무기 공격 1회(피해율 136%→272%)\n" +
  "\n" +
  "A : 신상사 : 장만성 : 액티브 : 적군 다수(3명) : 50% : 1턴 준비 후 적군 전체에게 패배 상태를 부여하여 턴마다 지속 피해(피해율 34%→68%, 무력의 영향), 2턴 지속\n" +
  "\n" +
  "A : 약점 간파 : 장패 : 액티브 : 단일 적군 : 50% : 통솔이 가장 낮은 단일 적군 대상에게 무기 공격 1회(피해율 92.5%→185%)\n" +
  "\n" +
  "A : 여상의 상갑 : 진무 : 액티브 : 우군 단일 : 35% : 자신의 통솔 22→44 증가 및 우군 단일 대상이 받는 피해 20%→40% 분담, 2턴 지속\n" +
  "\n" +
  "A : 요술 : 장보 : 액티브 : 적군 다수(3명) : 40% : 1턴 준비 후 적군 전체에게 모래폭풍 상태 부여, 턴마다 지속 피해(피해율 36%→72%, 지력의 영향)를 입히고 자신은 방어 1회를 획득해 피해 면역, 2턴 지속\n" +
  "\n" +
  "A : 용감한 제비 : 장연 : 액티브 : 단일 적군 : 40% : 단일 적군 대상에게 무기 공격(피해율 42%→84%) 랜덤으로 2~4회 시전\n" +
  "\n" +
  "A : 용맹한 행군 : 호거아 : 액티브 : 단일 적군 : 45% : 단일 적군 대상에게 1턴 동안 무장 해제 상태(일반 공격 불가)부여 및 자신이 2턴 동안 필중 상태 획득, 목표가 이미 무장 해제 상태 시(일반 공격 불가)무기 공격(피해율156%, 속도의 영향)\n" +
  "\n" +
  "A : 위풍당당 : 기령 : 액티브 : 적군 다수(1~2명) : 30%→45% : 단일 적군 대상에게 도발(목표가 자신을 일반 공격) 또는 무장 해제(일반 공격 불가)상태 부여, 2턴 지속, 37.5%→75%의 확률로 추가 시전 1회\n" +
  "\n" +
  "A : 의성 : 서성 : 액티브 : 자신 : 75% : 자신의 혼란상태 면역 및 무력 34→68 증가, 2턴 지속\n" +
  "\n" +
  "A : 일격 섬멸 : 장량 : 액티브 : 단일 적군 : 40% : 1턴 준비 후 단일 적군 대상에게 무기 공격1회(피해율167.5%→335%), 목표가 모래폭풍 상태이면 추가로 혼란 상태(전법과 관계없이 목표 선택해 공격)부여, 2턴 지속\n" +
  "\n" +
  "A : 전투의 귀재 : 조홍 : 액티브 : 단일 적군 : 35% : 1턴 준비 후 단일 적군 대상에게 무기 공격 1회(피해율150%→300%)및 자신의 속도 20→40증가, 2턴 지속\n" +
  "\n" +
  "A : 정화 : 이엄 : 액티브 : 아군 다수 : 30%→45% : 아군 다수 대상(2명)의 무력, 지력, 속도 12→24 증가, 2턴 지속 및 디버프 해제\n" +
  "\n" +
  "A : 정확한 예측 : 유엽 : 액티브 : 적군 다수(2명) : 35% : 적군 다수 대상(2명)에게 책략 피해(피해율 53%→106%, 지력의 영향)를 주고 목표가 주는 피해 8%→16% 감소, 2턴 지속\n" +
  "\n" +
  "A : 좌우개궁 : 한당 : 액티브 : 단일 적군 : 35% : (궁병 전용)자신의 회심 확률(발동 시 무기 피해 100%증가) 6.5%→13%증가 및 단일 적군 대상에게 무기 공격1회(피해율 90%→180%), 목표가 기병이면 추가로 패배 상태를 부여하여 턴마다 지속 피해(피해율 45%→90%, 무력의 영향), 2턴 지속\n" +
  "\n" +
  "A : 좌절의 습격 : 조창 : 액티브 : 적군 다수(2명) : 25%→35% : 1턴 준비 후 적군 다수 대상(2명)에게 허약 상태(피해 주기 불가)부여, 1턴 지속. 목표가 이미 허약 상태이면 맹격 1회로 변경(피해율 188%)\n" +
  "\n" +
  "A : 진언 : 곽도 : 액티브 : 우군 단일 : 35% : 우군 단일 대상의 액티브 전법 발동률 4%→8% 및 지력 20→40 증가, 2턴 지속\n" +
  "\n" +
  "A : 천 리의 구원  주환 : 액티브 : 우군 다수(2명) : 40% : 우군 전체를 지원하고 자신의 통솔 20→40 증가, 1턴 지속\n" +
  "\n" +
  "A : 추방 : 마철 : 액티브 : 적군 다수(3명) : 30%→45% : 적군 전체의 버프 해제 및 자신의 지력 14→28 증가, 3턴 지속\n" +
  "\n" +
  "A : 출병 약탈 : 이각 : 액티브 : 단일 적군 : 35% : 단일 적군 대상에게 무기 공격(피해율 86%→172% 및 공포 상태 부여(행동 불가), 1턴 지속\n" +
  "\n" +
  "A : 화려한 기략 : 황권 : 액티브 : 적군 다수(2명) : 45% : 1턴 준비 후 적군 다수 대상(2명)에게 연소, 중독 상태 부여, 턴마다 지속 피해(피해율 29%→58%, 지력의 영향), 2턴 지속\n" +
  "\n" +
  "A : 휴전 : 비의,유표 : 액티브 : 단일 적군 : 40% : 1턴 준비 후 아군 다수 대상(2명)의 책략 피해 12.5%→25% 증가, 1턴 지속. 이후 단일 적군 대상에게 책략 공격(피해율 105%→210%, 지력의 영향)\n" +
  "\n" +
  "A : 날렵한 칼날  문빙 : 돌격 : 단일 적군 : 30% : 일반 공격 후 공격 대상에게 추가로 무기 공격 1회(피해율 107→214%)\n" +
  "\n" +
  "A : 숨겨진 계책 : 한수 : 돌격 : 단일 적군 : 40% : 일반 공격 후 공격 목표에게 추가로 무기 공격 1회(피해율 72%→144%), 목표가 적군 주장이면 추가로 책략 공격1회(피해율 46%→92%, 지력의 영향)\n" +
  "\n" +
  "A : 용맹한 사수 : 사마가 : 돌격 : 단일 적군 : 40% : 일반 공격 후 공격 목표의 통솔 75→150 감소 및 허망 부여(액티브 전법 불가), 1턴 지속\n" +
  "\n" +
  "A : 고아한 정취 : 이엄 : 내정 : 자신 : 100% : 장수를 목재관으로 임명하면 목재 생산량 1%→2% 증가\n" +
  "\n" +
  "A : 고지식 : 마철 : 내정 : 자신 : 100% : 장수를 조련관으로 임명하면 명마 생산 확률 2%→4% 증가\n" +
  "\n" +
  "A : 군대 양성 : 제갈근 : 내정 : 자신 : 100% : 장수를 훈련사로 임명하면 훈련 경험치 1%→2% 증가\n" +
  "\n" +
  "A : 뛰어난 언변 : 양수 : 내정 : 자신 : 100% : 장수의 매력 12→24 증가\n" +
  "\n" +
  "A : 묘서명석 : 간옹 : 내정 : 자신 : 100% : 장수를 채석관으로 임명하면 석재 생산량 1%→2% 증가\n" +
  "\n" +
  "A : 밝은 통찰력 : 여범 : 내정 : 자신 : 100% : 장수의 정치 12→24 증가\n" +
  "\n" +
  "A : 빛나는 쇠조각 : 종요 : 내정 : 자신 : 100% : 장수를 제철관으로 임명하면 철광 둔전의 수익 1.5%→3% 증가\n" +
  "\n" +
  "A : 선견지명 : 비의 : 내정 : 자신 : 100% : 장수를 무역관으로 임명하면 무역 비율 1%→2% 증가\n" +
  "\n" +
  "A : 세심한 보필 : 보연사 : 내정 : 자신 : 100% : 장수를 단조관으로 임명하면 단조 소모 2%→4% 감소\n" +
  "\n" +
  "A : 시급한 사안 : 유표 : 내정 : 자신 : 100% : 장수를 조련관으로 임명하면 조련 시간 5%→10% 감소\n" +
  "\n" +
  "A : 임기응변 : 미축 : 내정 : 자신 : 100% : 장수의 정치 12→24 증가 \n" +
  "\n" +
  "A : 절차탁마 : 동윤 : 내정 : 자신 : 100% : 장수를 제철관으로 임명하면 철광 생산량 1%→2% 증가\n" +
  "\n" +
  "A : 절처봉생 : 고옹 : 내정 : 자신 : 100% : 장수를 목재관으로 임명하면 목재 둔전의 수익 1.5%→3% 증가\n" +
  "\n" +
  "A : 조련의 장인 : 장로 : 내정 : 자신 : 100% : 장수를 조련관으로 임명하면 조련 소모 2%→4% 감소\n" +
  "\n" +
  "A : 주렁주렁 열매 : 진림 : 내정 : 자신 : 100% : 장수를 군량관으로 임명하면 식량 생산량 1%→2% 증가\n" +
  "\n" +
  "A : 풍성한 오곡 : 노식 , 내정 : 자신 : 100% : 장수를 군량관으로 임명하면 식량 둔전 수익 1.5%→3% 증가";

// refine data for search skill;
const util = require("util");

const data = desc
  .split("\n")
  .filter(el => el.startsWith("S") || el.startsWith("A"))
  .map(el => el.split(":"))
  .map((el) => {
    const dataInterpreter = el.map((item, idx) => {
      if (idx === 0) {
        return { rank: item.trim() };
      }
      if (idx === 1) {
        return { skillName: item.trim() };
      }
      if (idx === 2 ) {
        return { warLords: item.trim().split(",") };
      }
      if (idx === 3) {
        return { type: item.trim() };
      }
      if ( idx === 4) {
        return { target: item.trim() };
      }
      if ( idx === 5) {
        return { percentage: item.trim() };
      }
      if (idx === 6) {
        return { desc: item };
      }
    });

    return Object.assign({}, ...dataInterpreter);
  });

const log = util.inspect(data, { maxStringLength: null, maxArrayLength: null, depth: 4 });
